app/controllers/posts_controller.rb

  def index
    if user_signed_in?
      @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "published") VALUES (?, ?, ?, ?, ?)  [["title", "Private post"], ["description", "This is a private post"], ["created_at", "2022-05-12 08:09:39.259802"], ["updated_at", "2022-05-12 08:09:39.259802"], ["published", 1]]